In [18]:
import numpy as np
import pandas as pd

In [21]:
dict1={
    'name':['rohan','seema','mahes','shrruti'],
    'marks':[90,55,67,98],
    'city':['Delhi','Jaipur','Ranpur','Barilly']
    }

In [22]:
df=pd.DataFrame(dict1)

In [23]:
df

      name  marks     city
0    rohan     90    Delhi
1    seema     55   Jaipur
2    mahes     67   Ranpur
3  shrruti     98  Barilly

In [24]:
df.index=[1,2,3,4]

In [25]:
df

      name  marks     city
1    rohan     90    Delhi
2    seema     55   Jaipur
3    mahes     67   Ranpur
4  shrruti     98  Barilly

In [26]:
ser=pd.Series(np.random.rand(20))

In [27]:
ser

0     0.441648
1     0.537047
2     0.562320
3     0.825945
4     0.089664
5     0.412357
6     0.968415
7     0.494359
8     0.605012
9     0.276124
10    0.406289
11    0.980122
12    0.805586
13    0.288586
14    0.136522
15    0.821156
16    0.181494
17    0.603947
18    0.911614
19    0.688780
dtype: float64

In [28]:
type(ser)

pandas.core.series.Series

In [29]:
newdf=pd.DataFrame(np.random.rand(334,5),index=np.arange(334))

In [30]:
newdf

            0         1         2         3         4
0    0.805973  0.500789  0.607543  0.550469  0.044682
1    0.145065  0.682917  0.679630  0.922049  0.191953
2    0.634954  0.889486  0.651007  0.608953  0.648078
3    0.708746  0.652673  0.550523  0.492842  0.430261
4    0.303371  0.779365  0.101835  0.979090  0.296782
..        ...       ...       ...       ...       ...
329  0.404325  0.684782  0.431206  0.921425  0.181289
330  0.370813  0.596683  0.106424  0.790187  0.285070
331  0.498518  0.228208  0.672310  0.339003  0.563633
332  0.511531  0.805645  0.017078  0.750366  0.730120
333  0.041681  0.028796  0.641496  0.943427  0.498740

[334 rows x 5 columns]

In [31]:
newdf.head(3)

          0         1         2         3         4
0  0.805973  0.500789  0.607543  0.550469  0.044682
1  0.145065  0.682917  0.679630  0.922049  0.191953
2  0.634954  0.889486  0.651007  0.608953  0.648078

In [32]:
newdf.tail(3)

            0         1         2         3         4
331  0.498518  0.228208  0.672310  0.339003  0.563633
332  0.511531  0.805645  0.017078  0.750366  0.730120
333  0.041681  0.028796  0.641496  0.943427  0.498740

In [34]:
newdf.sort_index(axis=0)

            0         1         2         3         4
0    0.805973  0.500789  0.607543  0.550469  0.044682
1    0.145065  0.682917  0.679630  0.922049  0.191953
2    0.634954  0.889486  0.651007  0.608953  0.648078
3    0.708746  0.652673  0.550523  0.492842  0.430261
4    0.303371  0.779365  0.101835  0.979090  0.296782
..        ...       ...       ...       ...       ...
329  0.404325  0.684782  0.431206  0.921425  0.181289
330  0.370813  0.596683  0.106424  0.790187  0.285070
331  0.498518  0.228208  0.672310  0.339003  0.563633
332  0.511531  0.805645  0.017078  0.750366  0.730120
333  0.041681  0.028796  0.641496  0.943427  0.498740

[334 rows x 5 columns]

In [35]:
newdf.drop(0,axis=1)

            1         2         3         4
0    0.500789  0.607543  0.550469  0.044682
1    0.682917  0.679630  0.922049  0.191953
2    0.889486  0.651007  0.608953  0.648078
3    0.652673  0.550523  0.492842  0.430261
4    0.779365  0.101835  0.979090  0.296782
..        ...       ...       ...       ...
329  0.684782  0.431206  0.921425  0.181289
330  0.596683  0.106424  0.790187  0.285070
331  0.228208  0.672310  0.339003  0.563633
332  0.805645  0.017078  0.750366  0.730120
333  0.028796  0.641496  0.943427  0.498740

[334 rows x 4 columns]

In [37]:
newdf.dropna(inplace=True)